In [2]:
import numpy as np
import pandas as pd

In [4]:
df = pd.read_excel('data/salary_dataset.xlsx')

In [5]:
df.head()

   Unnamed: 0  YearsExperience  Salary
0           0              1.2   39344
1           1              1.4   46206
2           2              1.6   37732
3           3              2.1   43526
4           4              2.3   39892